app/controllers/api/kirish_controller.rb

    def create
      return error_insufficient_params unless params[:email].present? && params[:password].present?
      @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "messi@gmail.com"], ["LIMIT", 1]]