app/controllers/api/royxat_controller.rb

    def create
      @user = User.new(registration_params)

      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "email_confirmed_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)