app/controllers/worldcups_controller.rb

  def index
    @worldcups = Worldcup.all
---
SELECT "worldcups".* FROM "worldcups"