app/controllers/concerns/create_session.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def jwt_session_create user_id
      user = User.find_by(id: user_id)